[
    {
        "_id": "f1deb0821db74c36b4d4e3febc19fb74", 
        "corrected_question": "What fictional character's species is American Pekin duck", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/species> <http://dbpedia.org/resource/American_Pekin_duck> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "What <fictional character>'s <species> is <American Pekin duck>"
    }, 
    {
        "_id": "18993c411e4b43aa9d11cab3a62f9f88", 
        "corrected_question": "Count all the games whose distributors are located in America", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/property/distributor> ?x  . }", 
        "sparql_template_id": 106, 
        "verbalized_question": "Count the <video games> whose <distributed by>'s <sovereign state> is <United States>."
    }, 
    {
        "_id": "1f0f16883a764370b8cb9aae06e6d527", 
        "corrected_question": "Who is the spouse of Daniel Gibson? ", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/spouse> <http://dbpedia.org/resource/Daniel_Gibson>  . }", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who is the <person> whose <spouse> is <Daniel Gibson>?"
    }, 
    {
        "_id": "3e54cd98e79d4fa6b3b2dc7f2674c5d8", 
        "corrected_question": "Who wrote Heroman?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Heroman> <http://dbpedia.org/property/author> ?uri } ", 
        "sparql_template_id": 2, 
        "verbalized_question": "Who is the <authors> of Heroman ?"
    }
]