[
    {
        "_id": "c302f010d82f40b4819adce71cf9e672", 
        "corrected_question": "Count all those whose youth club was managed by Luis Enrique.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/manager> <http://dbpedia.org/resource/Luis_Enrique_(footballer)> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 106, 
        "verbalized_question": "How many <owls> are there whose <youthclubs>'s <team manager> is <Luis Enrique (footballer)> ?"
    }, 
    {
        "_id": "a4af0ba8a3fe4331ac77ceb9f178ed02", 
        "corrected_question": "Is Microsoft office written in C++", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Microsoft_Office> <http://dbpedia.org/property/programmingLanguage> <http://dbpedia.org/resource/C++> }", 
        "sparql_template_id": 151, 
        "verbalized_question": "Is <C++> the <programming language> of <Microsoft Office>?"
    }, 
    {
        "_id": "449ad6621b0e4991bd93d146a64becab", 
        "corrected_question": "Give me the total number of commander of the military conflicts whose commander is Roundhead (Wyandot).", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/commander> <http://dbpedia.org/resource/Roundhead_(Wyandot)> . ?x <http://dbpedia.org/ontology/commander> ?uri }", 
        "sparql_template_id": 111, 
        "verbalized_question": "Give me the total number of <commander> of the <military conflicts> whose <commander> is <Roundhead (Wyandot)>."
    }, 
    {
        "_id": "1e9caa7262cd4fd1a51cf31d4ba704e9", 
        "corrected_question": "Which company's division is Audi India? Correct Question", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/divisions> <http://dbpedia.org/resource/Audi_India> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "What is the <company> whose <divisions> is <Audi India>?"
    }, 
    {
        "_id": "fef09ad090cf49e09d0a7cc2b6befc0c", 
        "corrected_question": "Count all the things licensed as Software as a service.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/license> <http://dbpedia.org/resource/Software_as_a_service>  . }", 
        "sparql_template_id": 101, 
        "verbalized_question": "How many <software> are there whose <content license> is <Software as a service>?"
    }, 
    {
        "_id": "0961c5610ded49229b123d87522e0ce9", 
        "corrected_question": "Does Walt Disney Studio have a subsidiary called PixarCascadia_", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Walt_Disney_Studios_(division)> <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Pixar> }", 
        "sparql_template_id": 152, 
        "verbalized_question": "Is <Pixar> the <subsidiary> of <Walt Disney Studios (division)>?"
    }, 
    {
        "_id": "a8f0871a3d594450b08d3676964a27ff", 
        "corrected_question": "List the religions of the commanders of Royal Thai Army.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Royal_Thai_Army> <http://dbpedia.org/property/notableCommanders> ?x . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <religion> of the <office holder> who is the <notable commanders> of <Royal Thai Army> ?"
    }, 
    {
        "_id": "16bea2bafce74ca2990221d956a47fa0", 
        "corrected_question": "Name everyone working for a company owned by Roman Abramovich.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/owningCompany> <http://dbpedia.org/resource/Roman_Abramovich> . ?uri <http://dbpedia.org/ontology/occupation> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "Who is the <person> whose <craft>'s <owning company> is <Roman Abramovich>?"
    }, 
    {
        "_id": "59ee66fc1eb648ff9ca0e751825f1de1", 
        "corrected_question": "Whose doctoral student is etienne bieler\\xc9tienne_Bi\\xe9ler", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u00c9tienne_Bi\u00e9ler> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who is the <scientist> whose <doctoral student> is <tienne Biler>?"
    }, 
    {
        "_id": "c46d642e8b374c718591fa89a18d4498", 
        "corrected_question": "Name the ones who debuted in the San Francisco 49ers.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/debutTeam> <http://dbpedia.org/resource/San_Francisco_49ers>  . }", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who are the <american football players> whose <debut team> is <San Francisco 49ers>?"
    }, 
    {
        "_id": "7ebda29e423945b29162883cf737d24c", 
        "corrected_question": "Count the different religions followed by Second Lieutenants in military.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/militaryRank> <http://dbpedia.org/resource/Second_lieutenant> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "How many <religious affiliation> are there, of the <office holders> whose <military rank> is <Second lieutenant> ?"
    }, 
    {
        "_id": "bdb4b59b7f0f4610ada06b93495ffab9", 
        "corrected_question": "Is Eddie Bravo the trainer of Alan Jouban", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Alan_Jouban> <http://dbpedia.org/ontology/trainer> <http://dbpedia.org/resource/Eddie_Bravo> }", 
        "sparql_template_id": 152, 
        "verbalized_question": "Is <Eddie Bravo> the <trainer> of <Alan Jouban>?"
    }, 
    {
        "_id": "3ca24dd2487c4192af7eabf87b4a30f5", 
        "corrected_question": "Count all those who've played for the youth club which owns the Rosario, Santa Fe stadium.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Rosario,_Santa_Fe> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 106, 
        "verbalized_question": "Give the total number of <owls> whose <youthclubs>'s <ground> is <Rosario, Santa Fe>."
    }, 
    {
        "_id": "cf59b2f2f22e46d1af44c855e60632fe", 
        "corrected_question": "Count the different religions practiced by people who are in the Malaysian and Chinese association.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Malaysian_Chinese_Association> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "What is the total number of <religion> of the <politicians> whose <member of political party> is <Malaysian Chinese Association> ?"
    }, 
    {
        "_id": "f24f21d65b5f4fdaa1f972261523fabd", 
        "corrected_question": "List all those whose relatives' nationality is United States.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?uri <http://dbpedia.org/ontology/relative> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "List the <architects> whose <relative>'s <nationality> is <United States>."
    }, 
    {
        "_id": "9f517b6fe6cf44339df470bcabf4069d", 
        "corrected_question": "Count the  origin of the beverages which have been originated in england /", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/origin> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/origin> ?uri }", 
        "sparql_template_id": 111, 
        "verbalized_question": "Count the other <origin> of the <beverages> whose <origin> is <England>."
    }, 
    {
        "_id": "3783ed5014f64bc59ce995cf1be1dc9c", 
        "corrected_question": "Count the religions followed by people living in British Columbia.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/British_Columbia> . ?x <http://dbpedia.org/property/religion> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "Count the <religious affiliation> of the <politicians> whose <official residence> is <British Columbia>."
    }, 
    {
        "_id": "587b373a04ab48eeb4fd4cdba4abc95d", 
        "corrected_question": "For everyone who died in paris, count their different fields of work.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/deathPlace> <http://dbpedia.org/resource/Paris> . ?x <http://dbpedia.org/property/fields> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "Give the total number of <fields> of the <scientists> whose <location of death> is <Paris>."
    }, 
    {
        "_id": "5600cf1071264310a057ac57ba802779", 
        "corrected_question": "Name the members of youth clubs which have Camp Nou as their homeground.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/ground> <http://dbpedia.org/resource/Camp_Nou> . ?uri <http://dbpedia.org/property/youthclubs> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "What are the <owls> whose <youthclubs>'s <ground> is <Camp Nou>?"
    }, 
    {
        "_id": "973af98c92e24d1793c45d8c0ed3e83b", 
        "corrected_question": "Count the number of actors in Lucy Sullivan Is Getting Married.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <http://dbpedia.org/resource/Lucy_Sullivan_Is_Getting_Married> <http://dbpedia.org/property/starring> ?uri  . }", 
        "sparql_template_id": 102, 
        "verbalized_question": "Count the <actress> in <Lucy Sullivan Is Getting Married>?"
    }, 
    {
        "_id": "000c7ab2bce24308b9e2d7886852c5ab", 
        "corrected_question": "Name a few whose live in a place where Indian English is an official language", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/officialLanguage> <http://dbpedia.org/resource/Indian_English> . ?uri <http://dbpedia.org/ontology/residence> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "What are the <office holders> whose <official residence>'s <official language> is <Indian English>?"
    }, 
    {
        "_id": "3922223c92bd4c62a2b341fe8c73879c", 
        "corrected_question": "Give me a count of everything under the archipelago, where Papeete is the biggest town.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/largestCity> <http://dbpedia.org/resource/Papeete> . ?uri <http://dbpedia.org/property/archipelago> ?x  . }", 
        "sparql_template_id": 106, 
        "verbalized_question": "Give the total number of <owls> whose <archipelago>'s <largest city> is <Papeete>."
    }, 
    {
        "_id": "86de244495ad4682bba72845f387f090", 
        "corrected_question": "Who all have been canonized by Pope Paul VI", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/canonizedBy> <http://dbpedia.org/resource/Pope_Paul_VI> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who are the <saints> whose <canonized by> is <Pope Paul VI>?"
    }, 
    {
        "_id": "6ac000fc0bb7458f8556f603ed42e4b3", 
        "corrected_question": "List the base currency of the country whose anthem is Oj, svijetla majska zoro.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/anthem> <http://dbpedia.org/resource/Oj,_svijetla_majska_zoro> . ?x <http://dbpedia.org/property/currency> ?uri  . }", 
        "sparql_template_id": 5, 
        "verbalized_question": "List the <base currency> of the <owls> whose <anthem> is <Oj, svijetla majska zoro>."
    }, 
    {
        "_id": "2145991e2562420284c8984b7f845228", 
        "corrected_question": "List the children of the parent of Marvin Bush.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Marvin_Bush> <http://dbpedia.org/ontology/parent> ?x . ?x <http://dbpedia.org/property/children> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <children> of the <office holder> who is the <parent> of <Marvin Bush> ?"
    }, 
    {
        "_id": "29d041b6917e47cbbcc098c7a848a397", 
        "corrected_question": "How many ", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls>  . }", 
        "sparql_template_id": 101, 
        "verbalized_question": "Give me a count of <basketball players> whose <member of sports team> is <Chicago Bulls>?"
    }, 
    {
        "_id": "6b0903f50742485485384cf6feffa59b", 
        "corrected_question": "What is the almamater of the successor of F. A. Little, Jr.? ", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/F._A._Little,_Jr.> <http://dbpedia.org/ontology/successor> ?x . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <alma mater> of the <judge> who is the <successor> of <F. A. Little, Jr.> ?"
    }, 
    {
        "_id": "e3bdce2f724541fc987861adb5d4e715", 
        "corrected_question": "List everything in which saxophone players have been casted.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Saxophone> . ?uri <http://dbpedia.org/property/starring> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "What are the <owls> whose <actress>'s <plays> is <Saxophone>?"
    }, 
    {
        "_id": "6f768f7b19424f46bd39e6238cd0662c", 
        "corrected_question": "Is lion an animal?", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Lion> <http://dbpedia.org/ontology/kingdom> <http://dbpedia.org/resource/Animal> }", 
        "sparql_template_id": 151, 
        "verbalized_question": "Is <Animal> the <kingdom> of <Lion>?"
    }, 
    {
        "_id": "eeeeba8f2afb457886b8942434d292ac", 
        "corrected_question": "Count all the scientologists.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Scientology>  . }", 
        "sparql_template_id": 101, 
        "verbalized_question": "Give me a count of <people> whose <religion> is <Scientology>?"
    }, 
    {
        "_id": "fb24fef4bec1494480df389bd6d410c1", 
        "corrected_question": "What is a salthill?", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Salthill> <http://dbpedia.org/ontology/type> ?uri } ", 
        "sparql_template_id": 2, 
        "verbalized_question": "What is the <type> of Salthill ?"
    }, 
    {
        "_id": "02704dedd802497dbd1e9e9abcd3e0da", 
        "corrected_question": "Which state is the birth location of Ann Monroe Gilchrist Strong? ", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ann_Monroe_Gilchrist_Strong> <http://dbpedia.org/ontology/birthPlace> ?x . ?x <http://dbpedia.org/ontology/country> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <sovereign state> of the <settlement> which is the <birth location> of <Ann Monroe Gilchrist Strong> ?"
    }, 
    {
        "_id": "89b4110b9d064a0fb8feff6aa5aa2ff2", 
        "corrected_question": "List the awards given to the relatives of Gregorios Bernardakis.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Gregorios_Bernardakis> <http://dbpedia.org/ontology/relative> ?x . ?x <http://dbpedia.org/ontology/award> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <award received> of the <writer> who is the <relative> of <Gregorios Bernardakis> ?"
    }, 
    {
        "_id": "55b783d8ff214544b144eab6929fe919", 
        "corrected_question": " Count the participants of the NBA.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/National_Basketball_Association>  . }", 
        "sparql_template_id": 101, 
        "verbalized_question": "Give me a count of <basketball players> whose <league> is <National Basketball Association>?"
    }, 
    {
        "_id": "1cedfca911824453b06451cbc8104541", 
        "corrected_question": "Count the total religions followed by the ones living in England.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/England> . ?x <http://dbpedia.org/property/religion> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "Count the <religious affiliation> of the <people> whose <official residence> is <England>."
    }, 
    {
        "_id": "cd7f39c8d3324c20a0beff615cfa9063", 
        "corrected_question": "Is Serbian Titieca a doctoral student of Werner Heisenberghttp://dbpedia.org/resource/Werner_Heisenberg", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Werner_Heisenberg> <http://dbpedia.org/ontology/doctoralStudent> <http://dbpedia.org/resource/\u0218erban_\u021ai\u021beica> }", 
        "sparql_template_id": 151, 
        "verbalized_question": "Is <erban ieica> the <doctoral student> of <Werner Heisenberg>?"
    }, 
    {
        "_id": "9aa99d04670a49e185afbcd4d2a451f5", 
        "corrected_question": "Does the white river flow into the connecticut river{u'_id': u'97e02dcf44aa43c1b7cc7a7c155b118f',", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Connecticut_River> <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/White_River_(Vermont)> }", 
        "sparql_template_id": 151, 
        "verbalized_question": "Is <White River (Vermont)> the <right tributary> of <Connecticut River>?"
    }, 
    {
        "_id": "1088fd5c6f2948faa4ca297bf58ca3eb", 
        "corrected_question": "Where did ed podolak go to high school", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ed_Podolak> <http://dbpedia.org/ontology/highschool> ?uri } ", 
        "sparql_template_id": 2, 
        "verbalized_question": "What is the <highschool> of Ed Podolak ?"
    }, 
    {
        "_id": "f43f2072568f44aaa9450a64e62ca3da", 
        "corrected_question": "Count the number of judges who've come on CTV network shows.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/network> <http://dbpedia.org/resource/CTV_Television_Network> . ?x <http://dbpedia.org/property/judges> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "Give the total number of <judges> of the <television shows> whose <network> is <CTV Television Network>."
    }, 
    {
        "_id": "e0d8fe804adf4feab999453c822c20e4", 
        "corrected_question": "Give me the count of artist in the company whose Artist is Jean- Fran\u00e7ois Cot\u00e9 ?", 
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/artist> <http://dbpedia.org/resource/Jean-Fran\u00e7ois_Cot\u00e9> . ?x <http://dbpedia.org/property/artist> ?uri }", 
        "sparql_template_id": 111, 
        "verbalized_question": "Give me the count of <Artist> of the <companies> whose <Artist> is <Jean- Fran\u00e7ois  Cot\u00e9>>."
    }, 
    {
        "_id": "220dbedddb3a4970b6b74f1fa2282d6b", 
        "corrected_question": "List the sports played in private universities.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Private_university> . ?x <http://dbpedia.org/ontology/sport> ?uri  . }", 
        "sparql_template_id": 5, 
        "verbalized_question": "What is the <sport> of the <universities> which are <Private university>?"
    }, 
    {
        "_id": "60347895278a411187b6aaafce98462e", 
        "corrected_question": "Who is the performer of album which has the song \"To Where You Are\" ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/To_Where_You_Are> <http://dbpedia.org/ontology/album> ?x . ?x <http://dbpedia.org/ontology/artist> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <performer> of the <album> which is the <album> of <To Where You Are> ?"
    }, 
    {
        "_id": "ade7e2b4ed804a43a9a124fe2f3e4efc", 
        "corrected_question": "List the awards won by the wife of Ingrid von Rosen.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ingrid_von_Rosen> <http://dbpedia.org/property/spouse> ?x . ?x <http://dbpedia.org/property/awards> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <awards> of the <person> who is the <wife> of <Ingrid von Rosen> ?"
    }, 
    {
        "_id": "d7e5d2254df0467f9540e90433f7ea55", 
        "corrected_question": "Count the different genres of games published by Titus Software", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/publisher> <http://dbpedia.org/resource/Titus_Software> . ?x <http://dbpedia.org/ontology/genre> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "How many <genre> are there, of the <video games> whose <publisher> is <Titus Software> ?"
    }, 
    {
        "_id": "acbd41cd7e11412e8af8c45b2f8d29c6", 
        "corrected_question": "Count the awards given to the recepients of the Becket fund for religious liberty.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Becket_Fund_for_Religious_Liberty> . ?x <http://dbpedia.org/property/awards> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "What is the total number of <awards> of the <writers> whose <honours> is <Becket Fund for Religious Liberty> ?"
    }, 
    {
        "_id": "b107d70a40bd4d58953a8a9b4aacc109", 
        "corrected_question": "Count all the places where companies located in Ontario operate.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/locationCity> <http://dbpedia.org/resource/Ontario> . ?x <http://dbpedia.org/property/locations> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "How many <locations> are there, of the <companies> whose <location city> is <Ontario> ?"
    }, 
    {
        "_id": "432c5c5d446a4b608c1de47eac01170d", 
        "corrected_question": "Count the different alma maters of people employed by the CNN", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/employer> <http://dbpedia.org/resource/CNN> . ?x <http://dbpedia.org/ontology/almaMater> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "Give the total number of <alma mater> of the <people> whose <employer> is <CNN>."
    }, 
    {
        "_id": "418aec71a0ad4d5594d5667a98921501", 
        "corrected_question": "Name a famous relative of barry voight", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Barry_Voight>  . }", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who is the <person> whose <relative> is <Barry Voight>?"
    }, 
    {
        "_id": "7cd11e37116b4218a85d96fc128b3c02", 
        "corrected_question": "List places that are associated to cities in the state of Mecklenburg-Vorpommern.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/federalState> <http://dbpedia.org/resource/Mecklenburg-Vorpommern> . ?uri <http://dbpedia.org/property/cities> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "List the <lakes> whose <cities>'s <federal state> is <Mecklenburg-Vorpommern>."
    }, 
    {
        "_id": "61bd46182b1447fdba130dd495c98b61", 
        "corrected_question": "Where is the mouth of the river whose tributary is Bjelimi\u0107ka  Rijeka ?", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/rightTributary> <http://dbpedia.org/resource/Bjelimi\u0107ka_Rijeka> . ?x <http://dbpedia.org/ontology/mouthCountry> ?uri  . }", 
        "sparql_template_id": 5, 
        "verbalized_question": "What is the <mouth country> of the <place> whose <right tributary> is <Bjelimi\u0107ka  Rijeka>> ?"
    }, 
    {
        "_id": "47bc9fd86bf54061b9df63ac5d6789c1", 
        "corrected_question": "Name some books by Spanish speaking authors.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/language> <http://dbpedia.org/resource/Spanish_language> . ?uri <http://dbpedia.org/property/author> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "What are the <books> whose <author>'s <language> is <Spanish language>?"
    }, 
    {
        "_id": "5c6a09d1e72a45429f86bae07bb422e6", 
        "corrected_question": "Give me the characters who last appeared in Star Wars Episode 3", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/last> <http://dbpedia.org/resource/Star_Wars:_Episode_III_\u2013_Revenge_of_the_Sith> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "Who is the <fictional character> whose <last> is <Star Wars: Episode III  Revenge of the Sith>?"
    }, 
    {
        "_id": "6e5ca1c3866c4d40803a16e1119672a6", 
        "corrected_question": "Did Steve Sampson manage a club of Santa Clara university", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Steve_Sampson> <http://dbpedia.org/ontology/managerClub> <http://dbpedia.org/resource/Santa_Clara_University> }", 
        "sparql_template_id": 152, 
        "verbalized_question": "Is <Santa Clara University> the <manager club> of <Steve Sampson>?"
    }, 
    {
        "_id": "7fc3026611784ca68abe446d974bf7fb", 
        "corrected_question": "Count the different causes of death of Christians.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Christianity> . ?x <http://dbpedia.org/ontology/deathCause> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "How many <death cause> are there, of the <people> whose <religious affiliation> is <Christianity> ?"
    }, 
    {
        "_id": "888a87ee40884a92bb779b4a08e06f63", 
        "corrected_question": "List the alma mater of the person who is wedded to Sissela Bok.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Sissela_Bok> . ?x <http://dbpedia.org/property/almaMater> ?uri  . }", 
        "sparql_template_id": 5, 
        "verbalized_question": "List the <alma mater> of the <office holders> whose <wed> is <Sissela Bok>."
    }, 
    {
        "_id": "565549d096324c1ca053e79d2d314691", 
        "corrected_question": "Mazhar Ul Haq High School, Beerwah is affiliated to Islamic Religion", 
        "sparql_query": "ASK WHERE { <http://dbpedia.org/resource/Mazhar_Ul_Haq_High_School,_Beerwah> <http://dbpedia.org/property/religiousAffiliation> <http://dbpedia.org/resource/Islam> }", 
        "sparql_template_id": 152, 
        "verbalized_question": "Is <Islam> the <religious affiliation> of <Mazhar Ul Haq High School, Beerwah>?"
    }, 
    {
        "_id": "46394065a08e478b946f7994c131b013", 
        "corrected_question": "List all the tenants of the stadium where the WWF Summer Slam 2004 took place.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/SummerSlam_(2004)> <http://dbpedia.org/property/venue> ?x . ?x <http://dbpedia.org/ontology/tenant> ?uri  . }", 
        "sparql_template_id": 3, 
        "verbalized_question": "What is the <tenant> of the <stadium> which is the <venue> of <SummerSlam (2004)> ?"
    }, 
    {
        "_id": "75d8ae08f021434f8b64b8c089efb56e", 
        "corrected_question": "Who is married to Tony Ramo", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/partner> <http://dbpedia.org/resource/Tony_Romo>  . }", 
        "sparql_template_id": 1, 
        "verbalized_question": "What <person>'s <partner> is <Tony Romo>"
    }, 
    {
        "_id": "447a43a67f144236a29b626f440ec2a0", 
        "corrected_question": "Name some people working at someplace owned by News Corp.", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <http://dbpedia.org/property/owners> <http://dbpedia.org/resource/News_Corp> . ?uri <http://dbpedia.org/ontology/employer> ?x  . }", 
        "sparql_template_id": 6, 
        "verbalized_question": "Who are the <people> whose <workplace>'s <owners> is <News Corp>?"
    }, 
    {
        "_id": "9dc0111186b24e9c86ae66f5bd0cefcb", 
        "corrected_question": "Count the tenants of the stadiums owned by toronto.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Toronto> . ?x <http://dbpedia.org/property/tenants> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "How many <tenants> are there, of the <stadia> whose <is owned by> is <Toronto> ?"
    }, 
    {
        "_id": "8c33f93613d64297b003b2f378be8c76", 
        "corrected_question": "Count the number of religions followed by Janta Dal members.", 
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <http://dbpedia.org/property/party> <http://dbpedia.org/resource/Janata_Dal> . ?x <http://dbpedia.org/ontology/religion> ?uri  . }", 
        "sparql_template_id": 105, 
        "verbalized_question": "What is the total number of <faith> of the <people> whose <member of political party> is <Janata Dal> ?"
    }, 
    {
        "_id": "ab2e96b28d8345188ec38444b7b5d986", 
        "corrected_question": "Who did Bruce Bochy play for ? ", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Bruce_Bochy> <http://dbpedia.org/ontology/team> ?uri } ", 
        "sparql_template_id": 2, 
        "verbalized_question": "What is the <team played for> of Bruce Bochy ?"
    }, 
    {
        "_id": "498f586cd8424c38b3af6f802891e55a", 
        "corrected_question": "what are some journals of academic Philosophy", 
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/property/discipline> <http://dbpedia.org/resource/Philosophy> } ", 
        "sparql_template_id": 1, 
        "verbalized_question": "What are the <academic journals> whose <academic area> is <Philosophy>?"
    }, 
    {
        "_id": "20279be806b8412f9bc87ac6de8c50aa", 
        "corrected_question": "What are some products manufactured by Sony? ", 
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/Sony>  . }", 
        "sparql_template_id": 1, 
        "verbalized_question": "What are the <owls> whose <manufacturer> is <Sony>?"
    }
]