 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/New_Delhi> . ?x <http://dbpedia.org/ontology/residence> ?uri } 
What is the <residence> of the <Scientist> whose <alma Mater> is <New  Delhi> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/residence> <http://dbpedia.org/resource/Pune> . ?x <http://dbpedia.org/property/birthPlace> ?uri } 
What is the <birth Place> of the <Office Holder> whose <residence> is <Pune> ?
 **better class detection**

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/religion> <http://dbpedia.org/resource/Hinduism> . ?x <http://dbpedia.org/ontology/deathPlace> ?uri } 
What is the <death Place> of the <Office Holder> whose <religion> is <Hinduism> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/owner> <http://dbpedia.org/resource/Government_of_Maharashtra> . ?x <http://dbpedia.org/property/location> ?uri } 
What is the <location> of the <Dam> whose <owner> is <Government of  Maharashtra> ?
**List Rule: if Government of Maharashtra ownes multiple dams, then make it a list query.**
_List the location of the dams whose owner is Government of Maharashtra_

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Editing> . ?x <http://dbpedia.org/ontology/hometown> ?uri } 
What is the <hometown> of the <Musical Artist> whose <occupation> is <Editing> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/bandMember> <http://dbpedia.org/resource/Suzanne_D'Mello> . ?x <http://dbpedia.org/property/origin> ?uri } 
What is the <origin> of the <Band> whose <band Member> is <Suzanne D' Mello> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Chennai> . ?x <http://dbpedia.org/ontology/birthPlace> ?uri } 
What is the <birth Place> of the <Office Holder> whose <residence> is <Chennai> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Home_appliance> . ?x <http://dbpedia.org/property/locationCity> ?uri } 
What is the <location City> of the <Company> whose <industry> is <Home appliance> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Retail> . ?x <http://dbpedia.org/ontology/locationCity> ?uri } 
What is the <location City> of the <Company> whose <industry> is <Retail> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Insurance> . ?x <http://dbpedia.org/ontology/location> ?uri } 
What is the <location> of the <Bank> whose <industry> is <Insurance> ?
**BAD QUESTION**

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/property/deathPlace> ?uri } 
What is the <death Place> of the <Office Holder> whose <nationality> is <India> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Shivani_Tanksale__1> . ?x <http://dbpedia.org/property/residence> ?uri } 
What is the <residence> of the <Person> whose <occupation> is <Shivani  Tanksale  1> ?
**BAD TRIPLE**

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/industry> <http://dbpedia.org/resource/Advertising> . ?x <http://dbpedia.org/ontology/foundationPlace> ?uri } 
What is the <foundation Place> of the <Company> whose <industry> is <Advertising> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Sanjay_Gandhi_National_Park> . ?x <http://dbpedia.org/ontology/nearestCity> ?uri } 
What is the <nearest City> of the <Lake> whose <location> is <Sanjay  Gandhi  National  Park> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/state> <http://dbpedia.org/resource/Maharashtra> . ?x <http://dbpedia.org/property/city> ?uri } 
What is the <city> of the <School> whose <state> is <Maharashtra> ?
**LIST template**
_List the city of the schools whose state is Maharashtra_

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Privately_held_company> . ?x <http://dbpedia.org/ontology/regionServed> ?uri } 
What is the <region Served> of the <Company> whose <type> is <Privately held company> ?
**Type rule?**
_What is the region served of the company which is a Privately held company?_

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/country> <http://dbpedia.org/resource/India> . ?x <http://dbpedia.org/ontology/city> ?uri } 
What is the <city> of the <University> whose <country> is <India> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/leader> <http://dbpedia.org/resource/U._K._Sinha> . ?x <http://dbpedia.org/property/headquarters> ?uri } 
What is the <headquarters> of the <Government Agency> whose <leader> is <U. K.  Sinha> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/broadcastArea> <http://dbpedia.org/resource/Nepal> . ?x <http://dbpedia.org/ontology/headquarter> ?uri } 
What is the <headquarter> of the <Television Station> whose <broadcast Area> is <Nepal> ?
**LIST RULE**
_List the headquarter of the television stations whose broadcast area is Nepal_ 

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Bandra> . ?x <http://dbpedia.org/property/region> ?uri } 
What is the <region> of the <Hospital> whose <location> is <Bandra> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/New_York> . ?x <http://dbpedia.org/ontology/foundedBy> ?uri } 
What is the <founded By> of the <Company> whose <location City> is <New  York> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Manhattan> . ?x <http://dbpedia.org/property/owner> ?uri } 
What is the <owner> of the <Company> whose <location> is <Manhattan> ?
**BAD QUESTION**

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Fred_Trump__1> . ?x <http://dbpedia.org/ontology/child> ?uri } 
What is the <child> of the <Person> whose <occupation> is <Fred  Trump  1> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/locationCity> <http://dbpedia.org/resource/New_York_City> . ?x <http://dbpedia.org/ontology/keyPerson> ?uri } 
What is the <key Person> of the <Company> whose <location City> is <New  York  City> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Michael_D._Cohen_(lawyer)> . ?x <http://dbpedia.org/ontology/owningCompany> ?uri } 
What is the <owning Company> of the <Company> whose <key Person> is <Michael D.  Cohen (lawyer)> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Cohutta,_Georgia> . ?x <http://dbpedia.org/property/spouse> ?uri } 
What is the <spouse> of the <Person> whose <birth Place> is <Cohutta,  Georgia> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Maryanne_Trump_Barry> . ?x <http://dbpedia.org/ontology/parent> ?uri } 
What is the <parent> of the <Person> whose <relative> is <Maryanne  Trump  Barry> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Trump_Winery> . ?x <http://dbpedia.org/ontology/relative> ?uri } 
What is the <relative> of the <Person> whose <occupation> is <Trump  Winery> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Zlín> . ?x <http://dbpedia.org/ontology/spouse> ?uri } 
What is the <spouse> of the <Person> whose <birth Place> is <Zlín> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/New_York_University> . ?x <http://dbpedia.org/ontology/relation> ?uri } 
What is the <relation> of the <Person> whose <alma Mater> is <New  York  University> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/almaMater> <http://dbpedia.org/resource/University_of_California,_Berkeley> . ?x <http://dbpedia.org/ontology/occupation> ?uri } 
What is the <occupation> of the <Person> whose <alma Mater> is <University of  California,  Berkeley> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/AppleWorks> . ?x <http://dbpedia.org/ontology/parentCompany> ?uri } 
What is the <parent Company> of the <Company> whose <product> is <Apple Works> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/Zagreb> . ?x <http://dbpedia.org/property/employer> ?uri } 
What is the <employer> of the <owl> whose <birth Place> is <Zagreb> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/keyPerson> <http://dbpedia.org/resource/Noel_Lee_(executive)> . ?x <http://dbpedia.org/property/parent> ?uri } 
What is the <parent> of the <Company> whose <key Person> is <Noel  Lee (executive)> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/board> ?uri } 
What is the <board> of the <Person> whose <nationality> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/location> <http://dbpedia.org/resource/Austria> . ?x <http://dbpedia.org/ontology/product> ?uri } 
What is the <product> of the <Company> whose <location> is <Austria> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/California> . ?x <http://dbpedia.org/ontology/employer> ?uri } 
What is the <employer> of the <Cyclist> whose <residence> is <California> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Management_consulting> . ?x <http://dbpedia.org/ontology/service> ?uri } 
What is the <service> of the <Company> whose <industry> is <Management consulting> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/owner> ?uri } 
What is the <owner> of the <Company> whose <location Country> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Cupertino,_California> . ?x <http://dbpedia.org/ontology/affiliation> ?uri } 
What is the <affiliation> of the <University> whose <city> is <Cupertino,  California> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/locationCountry> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/genre> ?uri } 
What is the <genre> of the <Company> whose <location Country> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/successor> <http://dbpedia.org/resource/Henry_Pollock> . ?x <http://dbpedia.org/ontology/profession> ?uri } 
What is the <profession> of the <Office Holder> whose <successor> is <Henry  Pollock> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Hindu> . ?x <http://dbpedia.org/property/occupation> ?uri } 
What is the <occupation> of the <Person> whose <religion> is <Hindu> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/deputy> <http://dbpedia.org/resource/Shah_Mehmood_Qureshi> . ?x <http://dbpedia.org/property/profession> ?uri } 
What is the <profession> of the <Office Holder> whose <deputy> is <Shah  Mehmood  Qureshi> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/citizenship> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/almaMater> ?uri } 
What is the <alma Mater> of the <Scientist> whose <citizenship> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/nationality> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/ontology/training> ?uri } 
What is the <training> of the <Artist> whose <nationality> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/birthPlace> <http://dbpedia.org/resource/East_Baton_Rouge_Parish,_Louisiana> . ?x <http://dbpedia.org/ontology/almaMater> ?uri } 
What is the <alma Mater> of the <Office Holder> whose <birth Place> is <East  Baton  Rouge  Parish,  Louisiana> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/property/residence> <http://dbpedia.org/resource/Manhattan> . ?x <http://dbpedia.org/ontology/education> ?uri } 
What is the <education> of the <Person> whose <residence> is <Manhattan> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Betty_Cohen__1> . ?x <http://dbpedia.org/property/education> ?uri } 
What is the <education> of the <Person> whose <occupation> is <Betty  Cohen  1> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/United_States> . ?x <http://dbpedia.org/property/college> ?uri } 
What is the <college> of the <Golf Player> whose <nationality> is <United  States> ?

 SELECT DISTINCT ?uri, ?x WHERE { ?x <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Sculpture> . ?x <http://dbpedia.org/property/training> ?uri } 
What is the <training> of the <Artist> whose <field> is <Sculpture> ?

